{"posts":[{"title":"Road To Coding","text":"About MeTo make the introduction as short as possible, I am going to summarize myself into a few words. I am a student who majors in CS, a freelancer, and a blogger. My Github: https://github.com/evanthecoder30 My Email: ykz13552611927@gmail.com My Fiverr: search for my username -&gt; “caesarthecoder” Blog InformationThis blog serves as a recorder of my journey of learning computing machinery and it has a few attributes: It’s a place for everyone that wants to find inspiration from my experiences. In this blog, one can find the highest quality projects selected from Github.com, including multiple languages like C/C++, Python, Java and so forth. The ultimate purpose of the creation of this blog is to share knowledge with people who are interested in computer science and engineering. Most of the time, the blog will be updated often. A new Project Selection&amp;Review article will be posted online every week. As for fundamentals and techniques, I will post them as soon as I find anything worth sharing.","link":"/2023/02/18/Road2Coding/"},{"title":"The Best Operating System? Windows&#x2F;MacOS&#x2F;Linux","text":"","link":"/2023/02/21/The-Best-Operating-System-Windows-MacOS-Linux/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2023/02/18/hello-world/"}],"tags":[],"categories":[{"name":"Announcement","slug":"Announcement","link":"/categories/Announcement/"},{"name":"Hot Topic in CS","slug":"Hot-Topic-in-CS","link":"/categories/Hot-Topic-in-CS/"}],"pages":[{"title":"categories","text":"","link":"/categories/index.html"}]}